InformationRegisters/СоответствиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодставляемаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатуры/Forms/ФормаКопирования/Ext/Form/Module.bsl
&НаКлиенте
Процедура Скопировать(Команда)
	
	СкопироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеИсточник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.Номенклатура,
	|	СоответствиеНоменклатуры.НоменклатурнаяГруппа,
	|	СоответствиеНоменклатуры.Подразделение,
	|	СоответствиеНоменклатуры.ПодставляемаяНоменклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|ГДЕ
	|	СоответствиеНоменклатуры.Подразделение = &Подразделение
	|	И ВЫБОР
	|			КОГДА &НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СоответствиеНоменклатуры.Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.СоответствиеНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Подразделение = ПодразделениеПриемник;
		МенеджерЗаписи.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
		МенеджерЗаписи.ПодставляемаяНоменклатура = Выборка.ПодставляемаяНоменклатура;
		МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
